package com.moataz.afternoonhadeeth.data.source

class ZekrSource {

    fun zekrList(): String {
        val secondHadith = when (roll()) {
            1 -> "سبحان اللّه وبحمده سبحان اللّه العظيم"
            2 -> "سبحان اللّه العظيم وبحمده"
            3 -> "أعوذ بكلمات اللّه التّامّات من شرّ ما خلق"
            4 -> "لا إله إلّا اللّه وحده لا شريك له"
            5 -> "اللهم أغفر لنا وأرحمنا وعافنا"
            6 -> "رضيت بالله ربا وبالإسلام دينا"
            7 -> "لا حول ولا قوة إلا بالله"
            8 -> "رب إغفر لي ولوالدي"
            9 -> "ربنا تقبل منا إنك أنت السميع العليم"
            10 -> "ربنا آتنا في الدنيا حسنة وفي الآخرة حسنة"
            11 -> "اللهم قنا عذابك يوم يبعث عبادك"
            12 -> "ربنا لا تؤاخذنا إن نسينا أو أخطأنا"
            13 -> "رب هب لي حكما والحقني بالصالحين"
            14 -> "رب أوزعني أن أشكر نعمتك التي أنعمت علي"
            15 -> "سبحان اللّه والحمدلله ولا إله إلا الله"
            16 -> "اللهم علمنا ماينفعنا وأنفعنا بما علمتنا"
            17 -> "اللهم صلِّ و سلِّم على نبينا محمد"
            18 -> "أستغفر اللّه العظيم وأتوب إليه"
            19 -> "رَبِّ اشْرَحْ لِي صَدْرِي وَيَسِّرْ لِي أَمْرِي"
            20 -> "رَبِّ إغفر وإرحم وتجاوز عما تعلم"
            else -> "ربنا آمنا فأغفر لنا وارحمنا يارب"
        }
        return secondHadith
    }

    private fun roll(): Int {
        return (1..21).random()
    }
}